# DataFrame

In [2]:
import pandas as pd

In [3]:
data = {'state': ['ohio', 'ohio', 'ohio', 'neveda', 'neveda', 'neveda'],
        'year':  [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':   [1.5, 1.7, 3.6, 2.4, 2.9,3.2]}
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  neveda  2001  2.4
4  neveda  2002  2.9
5  neveda  2003  3.2

In [13]:
df1 = pd.DataFrame(data,columns=['year','state','pop','extra','Debt'],index = ['one','two','three','four','five','six'])  #columns redefined

In [14]:
df1    # extra columns show NaN

       year   state  pop extra Debt
one    2000    ohio  1.5   NaN  NaN
two    2001    ohio  1.7   NaN  NaN
three  2002    ohio  3.6   NaN  NaN
four   2001  neveda  2.4   NaN  NaN
five   2002  neveda  2.9   NaN  NaN
six    2003  neveda  3.2   NaN  NaN

In [15]:
df1.columns   #check columns

Index(['year', 'state', 'pop', 'extra', 'Debt'], dtype='object')

In [17]:
df1.index   #check index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [18]:
df1.year  #click one value with row

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [19]:
df1['year']  #click one value with row

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [22]:
df1.loc['one']  # check location

year     2000
state    ohio
pop       1.5
extra     NaN
Debt      NaN
Name: one, dtype: object

In [23]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])
val    # value on rows

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [24]:
df1.Debt=val

In [25]:
df1

       year   state  pop extra  Debt
one    2000    ohio  1.5   NaN   NaN
two    2001    ohio  1.7   NaN  -1.2
three  2002    ohio  3.6   NaN   NaN
four   2001  neveda  2.4   NaN  -1.5
five   2002  neveda  2.9   NaN  -1.7
six    2003  neveda  3.2   NaN   NaN

# New Data Frame

In [37]:
pop = {'neveda': {2001: 2.4, 2002: 2.9},   #dictionary with key and value
       'ohio': {2002:1.5, 2003: 1.7, 2004: 3.6}}
frame3 = pd.DataFrame(pop)

In [38]:
frame3

      neveda  ohio
2001     2.4   NaN
2002     2.9   1.5
2003     NaN   1.7
2004     NaN   3.6

In [31]:
p1 = {'city': {'karahi': 1, 'lhr': 2},
      'other':{'muree': 3, 'isl': 4}}
cities = pd.DataFrame(p1)
cities

        city  other
isl      NaN    4.0
karahi   1.0    NaN
lhr      2.0    NaN
muree    NaN    3.0

In [41]:
frame3 = pd.DataFrame(pop, index= [2001,2002,2005])
frame3

      neveda  ohio
2001     2.4   NaN
2002     2.9   1.5
2005     NaN   NaN

In [42]:
frame3

      neveda  ohio
2001     2.4   NaN
2002     2.9   1.5
2005     NaN   NaN

In [43]:
pdata = {'ohio': frame3['ohio'][:-1],
         'neveda':frame3['neveda'][:2]}
pdata

{'ohio': 2001    NaN
 2002    1.5
 Name: ohio, dtype: float64, 'neveda': 2001    2.4
 2002    2.9
 Name: neveda, dtype: float64}

In [44]:
pdata = pd.DataFrame(pdata)
pdata

      ohio  neveda
2001   NaN     2.4
2002   1.5     2.9

In [45]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3   # set the names

state  neveda  ohio
year
2001      2.4   NaN
2002      2.9   1.5
2005      NaN   NaN

In [46]:
frame3.values   #select the values

array([[2.4, nan],
       [2.9, 1.5],
       [nan, nan]])